Revit 2027 API
BuiltInFailures.RevisionFailures.RevisionSettingsDuplicateName Property
 More than one Revisons have the same name %1!s!.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RevisionSettingsDuplicateName { get; }
Public Shared ReadOnly Property RevisionSettingsDuplicateName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RevisionSettingsDuplicateName {
	FailureDefinitionId^ get ();
}
static member RevisionSettingsDuplicateName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevisionFailures Class
Autodesk.Revit.DB Namespace